# What is Series of Pandas
    1.One-Dimensional
    2.Labeled Arrays
    3.Of any Data Type(Float,Object, Integer)
    4.A Sequence of Values
    5.With Associated Labels

# Impoting Pandas Libraries

In [1]:
# Importing Pandas Library
import pandas as pd

In [2]:
#Create a python List
student=["Shojib","Eshan","Rifat"]

In [3]:
#Showing Data type 
type(student)

list

In [4]:
#Pandas Series cosist of list of String value
pd.Series(["Shojib","Eshan","Rifat"])

0    Shojib
1     Eshan
2     Rifat
dtype: object

In [5]:
#Createing another List
ages=[21,10,5]

In [6]:
#Pandas Series consist of list of Integer value
pd.Series([21,10,5])

0    21
1    10
2     5
dtype: int64

In [7]:
#Pandas Series consist of list of Boolean value
pd.Series([True, False])

0     True
1    False
dtype: bool

In [8]:
#Making Float type of List
height=[167.4,173.2,190.0]

In [9]:
#Pandas Series consist of Floating point of value.
pd.Series([167.4,173.2,190.0])

0    167.4
1    173.2
2    190.0
dtype: float64

In [10]:
# Create of Mixed Data type of list
mixed=[True, 'Say',{"My_Mod",100}]

In [11]:
# Pandas Series Support mixed Data Type
pd.Series([True, 'Say',{"My_Mod",100}])

0             True
1              Say
2    {My_Mod, 100}
dtype: object

## Different Between Parameters Vs Arguments

In [12]:
#Parameters is a definition or variable which is associated with argument
pd.Series(data=student)#"Data" is a parameter and "student" is a argument

0    Shojib
1     Eshan
2     Rifat
dtype: object

In [13]:
#Argument is a variable which is associated with Parameters
pd.Series(student)#"Student" where is a Argument

0    Shojib
1     Eshan
2     Rifat
dtype: object

In [14]:
#Creating Function for understanding Arg vs Parameters
def greeting(something):# "something" is a parameters
    print(something)

In [15]:
greeting("Assalamualikum (Praise and Allah's Mercy Upon you)")
# "This Sentence" is a argument

Assalamualikum (Praise and Allah's Mercy Upon you)

## What is in the Data

In [16]:
# Making list
books_list=["A","B","C"]

In [17]:
# Creating Pandas Series
lis=pd.Series(books_list)
lis

0    A
1    B
2    C
dtype: object

In [18]:
# Making Dictonary
books_list={0:"A",1:"B",2:"C"}# Pandas Series Have Index and Object

In [19]:
# Creating Pandas Series
dic=pd.Series(books_list)
dic

0    A
1    B
2    C
dtype: object

In [20]:
lis.equals(dic)# 'Equal' function where is Showed data type is same or not

True

In [21]:
pd.Series(100)

0    100
dtype: int64

In [22]:
pd.Series("S")

0    S
dtype: object

In [23]:
# List Argument: pd.Series(data=['a','b','c'])
# Dict Argument:pd.Series(data={0:'a',1:'b',2:'c'})
# Also Valid Sereis: pd.Series(data=0) pd.Series(data='Weather')

In [24]:
pd.Series(data=0)# "Data" where is Parameter

0    0
dtype: int64

In [25]:
pd.Series(data='Wealther')# "Data" where is Parameter

0    Wealther
dtype: object

# The dtype Attribute

In [26]:
#Dtype is a attribue for series which is property of series
dt=pd.Series(books_list)

In [27]:
dt

0    A
1    B
2    C
dtype: object

In [28]:
dt=pd.Series(data=books_list,dtype="string")

In [29]:
dt

0    A
1    B
2    C
dtype: string

In [30]:
dt.size

3

##### What is the different of Method vs Attribute
    A Method is function which bound to the object
    A Attribute is a variable which bount to the object

In [31]:
dt

0    A
1    B
2    C
dtype: string

In [32]:
dic

0    A
1    B
2    C
dtype: object

In [33]:
dt.equals(dic) # here "Equals" is function which bound to the object
# Why false beacuse here dtype is different

False

In [34]:
dt.size # here "size" is variable which bound to the object

3

##### Index vs RangeIndex
    Index is label assocosited with value
    RangeIndex is a memeory saving speacial case which use creating range of value

In [35]:
list(pd.RangeIndex(start=10,stop=20,step=1))

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [36]:
dt.index.name="Index"

In [37]:
dt

Index
0    A
1    B
2    C
dtype: string

In [38]:
dt.index

Int64Index([0, 1, 2], dtype='int64', name='Index')

In [39]:
dt.name="Index" # here "Name" is attribute which is showed Series name

In [40]:
dt

Index
0    A
1    B
2    C
Name: Index, dtype: string

In [41]:
a=["a","b","c"]
b=[3,4,6]

In [42]:
pd.Series(data=b,index=a,name="Number")

a    3
b    4
c    6
Name: Number, dtype: int64

In [43]:
c={"a":3,"b":4,"c":5}

In [44]:
pd.Series(c)

a    3
b    4
c    5
dtype: int64

In [45]:
list(zip(a,b))# Zip is function which mergining two list

[('a', 3), ('b', 4), ('c', 6)]

In [46]:
dict(zip(a,b))

{'a': 3, 'b': 4, 'c': 6}

In [47]:
pd.Series(dict(zip(a,b)),name="Zip")

a    3
b    4
c    6
Name: Zip, dtype: int64

In [48]:
{a:b for a,b in zip(a,b)}

{'a': 3, 'b': 4, 'c': 6}

# Datasets Importing

In [49]:
from sklearn import datasets
import numpy as np

In [50]:
iris = datasets.load_iris()

In [51]:
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'C:\\Users\\mdsoh\\anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv'}

In [52]:
data=iris.data

In [53]:
data

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2],
       [4.6, 3.1, 1.5, 0.2],
       [5. , 3.6, 1.4, 0.2],
       [5.4, 3.9, 1.7, 0.4],
       [4.6, 3.4, 1.4, 0.3],
       [5. , 3.4, 1.5, 0.2],
       [4.4, 2.9, 1.4, 0.2],
       [4.9, 3.1, 1.5, 0.1],
       [5.4, 3.7, 1.5, 0.2],
       [4.8, 3.4, 1.6, 0.2],
       [4.8, 3. , 1.4, 0.1],
       [4.3, 3. , 1.1, 0.1],
       [5.8, 4. , 1.2, 0.2],
       [5.7, 4.4, 1.5, 0.4],
       [5.4, 3.9, 1.3, 0.4],
       [5.1, 3.5, 1.4, 0.3],
       [5.7, 3.8, 1.7, 0.3],
       [5.1, 3.8, 1.5, 0.3],
       [5.4, 3.4, 1.7, 0.2],
       [5.1, 3.7, 1.5, 0.4],
       [4.6, 3.6, 1. , 0.2],
       [5.1, 3.3, 1.7, 0.5],
       [4.8, 3.4, 1.9, 0.2],
       [5. , 3. , 1.6, 0.2],
       [5. , 3.4, 1.6, 0.4],
       [5.2, 3.5, 1.5, 0.2],
       [5.2, 3.4, 1.4, 0.2],
       [4.7, 3.2, 1.6, 0.2],
       [4.8, 3.1, 1.6, 0.2],
       [5.4, 3.4, 1.5, 0.4],
       [5.2, 4.1, 1.5, 0.1],
       [5.5, 4.2, 1.4, 0.2],
       [4.9, 3.1, 1.5, 0.2],
       [5. , 3.2, 1.2, 0.2],
       [5.5, 3.5, 1.3, 0.2],
       [4.9, 3.6, 1.4, 0.1],
       [4.4, 3. , 1.3, 0.2],
       [5.1, 3.4, 1.5, 0.2],
       [5. , 3.5, 1.3, 0.3],
       [4.5, 2.3, 1.3, 0.3],
       [4.4, 3.2, 1.3, 0.2],
       [5. , 3.5, 1.6, 0.6],
       [5.1, 3.8, 1.9, 0.4],
       [4.8, 3. , 1.4, 0.3],
       [5.1, 3.8, 1.6, 0.2],
       [4.6, 3.2, 1.4, 0.2],
       [5.3, 3.7, 1.5, 0.2],
       [5. , 3.3, 1.4, 0.2],
       [7. , 3.2, 4.7, 1.4],
       [6.4, 3.2, 4.5, 1.5],
       [6.9, 3.1, 4.9, 1.5],
       [5.5, 2.3, 4. , 1.3],
       [6.5, 2.8, 4.6, 1.5],
       [5.7, 2.8, 4.5, 1.3],
       [6.3, 3.3, 4.7, 1.6],
       [4.9, 2.4, 3.3, 1. ],
       [6.6, 2.9, 4.6, 1.3],
       [5.2, 2.7, 3.9, 1.4],
       [5. , 2. , 3.5, 1. ],
       [5.9, 3. , 4.2, 1.5],
       [6. , 2.2, 4. , 1. ],
       [6.1, 2.9, 4.7, 1.4],
       [5.6, 2.9, 3.6, 1.3],
       [6.7, 3.1, 4.4, 1.4],
       [5.6, 3. , 4.5, 1.5],
       [5.8, 2.7, 4.1, 1. ],
       [6.2, 2.2, 4.5, 1.5],
       [5.6, 2.5, 3.9, 1.1],
       [5.9, 3.2, 4.8, 1.8],
       [6.1, 2.8, 4. , 1.3],
       [6.3, 2.5, 4.9, 1.5],
       [6.1, 2.8, 4.7, 1.2],
       [6.4, 2.9, 4.3, 1.3],
       [6.6, 3. , 4.4, 1.4],
       [6.8, 2.8, 4.8, 1.4],
       [6.7, 3. , 5. , 1.7],
       [6. , 2.9, 4.5, 1.5],
       [5.7, 2.6, 3.5, 1. ],
       [5.5, 2.4, 3.8, 1.1],
       [5.5, 2.4, 3.7, 1. ],
       [5.8, 2.7, 3.9, 1.2],
       [6. , 2.7, 5.1, 1.6],
       [5.4, 3. , 4.5, 1.5],
       [6. , 3.4, 4.5, 1.6],
       [6.7, 3.1, 4.7, 1.5],
       [6.3, 2.3, 4.4, 1.3],
       [5.6, 3. , 4.1, 1.3],
       [5.5, 2.5, 4. , 1.3],
       [5.5, 2.6, 4.4, 1.2],
       [6.1, 3. , 4.6, 1.4],
       [5.8, 2.6, 4. , 1.2],
       [5. , 2.3, 3.3, 1. ],
       [5.6, 2.7, 4.2, 1.3],
       [5.7, 3. , 4.2, 1.2],
       [5.7, 2.9, 4.2, 1.3],
       [6.2, 2.9, 4.3, 1.3],
       [5.1, 2.5, 3. , 1.1],
       [5.7, 2.8, 4.1, 1.3],
       [6.3, 3.3, 6. , 2.5],
       [5.8, 2.7, 5.1, 1.9],
       [7.1, 3. , 5.9, 2.1],
       [6.3, 2.9, 5.6, 1.8],
       [6.5, 3. , 5.8, 2.2],
       [7.6, 3. , 6.6, 2.1],
       [4.9, 2.5, 4.5, 1.7],
       [7.3, 2.9, 6.3, 1.8],
       [6.7, 2.5, 5.8, 1.8],
       [7.2, 3.6, 6.1, 2.5],
       [6.5, 3.2, 5.1, 2. ],
       [6.4, 2.7, 5.3, 1.9],
       [6.8, 3. , 5.5, 2.1],
       [5.7, 2.5, 5. , 2. ],
       [5.8, 2.8, 5.1, 2.4],
       [6.4, 3.2, 5.3, 2.3],
       [6.5, 3. , 5.5, 1.8],
       [7.7, 3.8, 6.7, 2.2],
       [7.7, 2.6, 6.9, 2.3],
       [6. , 2.2, 5. , 1.5],
       [6.9, 3.2, 5.7, 2.3],
       [5.6, 2.8, 4.9, 2. ],
       [7.7, 2.8, 6.7, 2. ],
       [6.3, 2.7, 4.9, 1.8],
       [6.7, 3.3, 5.7, 2.1],
       [7.2, 3.2, 6. , 1.8],
       [6.2, 2.8, 4.8, 1.8],
       [6.1, 3. , 4.9, 1.8],
       [6.4, 2.8, 5.6, 2.1],
       [7.2, 3. , 5.8, 1.6],
       [7.4, 2.8, 6.1, 1.9],
       [7.9, 3.8, 6.4, 2. ],
       [6.4, 2.8, 5.6, 2.2],
       [6.3, 2.8, 5.1, 1.5],
       [6.1, 2.6, 5.6, 1.4],
       [7.7, 3. , 6.1, 2.3],
       [6.3, 3.4, 5.6, 2.4],
       [6.4, 3.1, 5.5, 1.8],
       [6. , 3. , 4.8, 1.8],
       [6.9, 3.1, 5.4, 2.1],
       [6.7, 3.1, 5.6, 2.4],
       [6.9, 3.1, 5.1, 2.3],
       [5.8, 2.7, 5.1, 1.9],
       [6.8, 3.2, 5.9, 2.3],
       [6.7, 3.3, 5.7, 2.5],
       [6.7, 3. , 5.2, 2.3],
       [6.3, 2.5, 5. , 1.9],
       [6.5, 3. , 5.2, 2. ],
       [6.2, 3.4, 5.4, 2.3],
       [5.9, 3. , 5.1, 1.8]])

In [54]:
target=iris.target

In [55]:
target

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [56]:
data=pd.DataFrame(data=iris.data,columns=iris.feature_names)

In [57]:
data

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

## Series Sizing With .size,.shape,And len()

In [58]:
ids=pd.Series(iris.data[:,0],name="sepal length (cm)")

In [59]:
ids.size

150

In [60]:
ids.shape

(150,)

In [61]:
len(ids)

150

In [62]:
ids.size==len(ids)

True

In [63]:
ids.head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal length (cm), dtype: float64

In [64]:
df=pd.DataFrame([[0,1,2],[0,4,1],[10,20,30]],index=[4,5,6],columns=["A","B","C"])

In [65]:
df

    A   B   C
4   0   1   2
5   0   4   1
6  10  20  30

## Unique Values And Series Monotonicity

In [66]:
pd.Series([pd.Timestamp('2020-01-01',tz='US/Eastern') for _ in range(3)]).unique()

<DatetimeArray>
['2020-01-01 00:00:00-05:00']
Length: 1, dtype: datetime64[ns, US/Eastern]

In [67]:
ids.unique().size

35

In [68]:
len(ids.unique())

35

In [69]:
pd.Series(pd.Categorical(list('aabc'))).unique()

['a', 'b', 'c']
Categories (3, object): ['a', 'b', 'c']

In [70]:
ids.nunique()

35

In [71]:
ids.is_unique

False

In [72]:
ids.is_monotonic

False

In [73]:
ids.is_monotonic_decreasing

False

## The Count() Method

In [74]:
ids.head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal length (cm), dtype: float64

In [75]:
ids.count()

150

In [76]:
s = pd.Series(['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat'])

In [77]:
s

0       A
1       B
2    Aaba
3    Baca
4     NaN
5    CABA
6     cat
dtype: object

In [78]:
s.str.count('a')

0    0.0
1    0.0
2    2.0
3    2.0
4    NaN
5    0.0
6    1.0
dtype: float64

In [79]:
s = pd.Series(['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat'])

In [80]:
s

0       $
1       B
2    Aab$
3    $$ca
4    C$B$
5     cat
dtype: object

In [81]:
s.str.count('\\$')

0    1
1    0
2    1
3    2
4    2
5    0
dtype: int64

In [82]:
pd.Index(['A', 'A', 'Aaba', 'cat']).str.count('a')

Int64Index([0, 0, 2, 1], dtype='int64')

## Notnull and Notna

In [83]:
ids

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

### Detect existing (non-missing) values and get mapped true, Characters such as empty strings ''" or numpy.inf are not considered NA values (unless you set pandas.options.mode.use_inf_as_na = True). NA values, such as None or numpy.NaN, get mapped to False values.

In [84]:
ids.notnull()

0      True
1      True
2      True
3      True
4      True
       ...
145    True
146    True
147    True
148    True
149    True
Name: sepal length (cm), Length: 150, dtype: bool

In [85]:
[ids.notnull()]

[0      True
 1      True
 2      True
 3      True
 4      True
        ...
 145    True
 146    True
 147    True
 148    True
 149    True
 Name: sepal length (cm), Length: 150, dtype: bool]

In [86]:
ids[ids.notnull()]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

In [87]:
'''empty strings '' or numpy.inf are not considered NA values unless you set (pandas.options.mode.use_inf_as_na = True)'''
pd.options.mode.use_inf_as_na=True

In [88]:
np.inf

inf

In [89]:
df = pd.DataFrame(dict(age=[5, 6, np.NaN],
                   born=[pd.NaT, pd.Timestamp('1939-05-27'),
                         pd.Timestamp('1940-04-25')],
                   name=['Alfred', 'Batman', ''],
                   toy=[None, 'Batmobile', 'Joker']))

In [90]:
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [91]:
df.notna()

     age   born  name    toy
0   True  False  True  False
1   True   True  True   True
2  False   True  True   True

In [92]:
#Booleans Are Literally Numbers
df[df.notna()]

   age       born    name        toy
0  5.0        NaT  Alfred        NaN
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [93]:
ser = pd.Series([5, 6, np.NaN])
ser

0    5.0
1    6.0
2    NaN
dtype: float64

## Droping and Filling NAs

In [94]:
# Return new Series with missing values removed

In [95]:
ser = pd.Series([1., 2., np.nan])

In [96]:
ser

0    1.0
1    2.0
2    NaN
dtype: float64

In [97]:
ser.dropna(inplace=True)

In [98]:
ser

0    1.0
1    2.0
dtype: float64

In [99]:
ser = pd.Series([np.NaN, 2, pd.NaT, '', None, 'I stay'])

In [100]:
ser

0       NaN
1         2
2       NaT
3
4      None
5    I stay
dtype: object

In [101]:
# Empty strings are not considered NA values. None is considered an NA value.
ser.dropna()

1         2
3
5    I stay
dtype: object

In [102]:
# Fillna
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))

In [103]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [104]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [105]:
# We can also propagate non-null values forward or backward.
df.fillna(method="ffill")

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [106]:
# Replace all NaN elements in column ‘A’, ‘B’, ‘C’, and ‘D’, with 0, 1, 2, and 3 respectively.
values={"A": 0, "B": 1, "C": 2, "D": 3}

In [107]:
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [108]:
# Only replace the first NaN element.
df.fillna(value=values,limit=2)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  NaN  5
3  NaN  3.0  NaN  4

In [109]:
# When filling using a DataFrame, replacement happens along the same column names and same indices
df2 = pd.DataFrame(np.ones((4, 4)), columns=list("ABCE"))

In [110]:
df.fillna(value=df2)

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  4.0  1.0  1
2  1.0  1.0  1.0  5
3  1.0  3.0  1.0  4

In [111]:
np.number

numpy.number

## Descriptive Statistics

In [112]:
s = pd.Series([1, 2, 3, 3])

In [113]:
s.describe()

count    4.000000
mean     2.250000
std      0.957427
min      1.000000
25%      1.750000
50%      2.500000
75%      3.000000
max      3.000000
dtype: float64

In [114]:
# Describing a categorical Series
s = pd.Series(['a', 'a', 'b', 'c'])

In [115]:
s

0    a
1    a
2    b
3    c
dtype: object

In [116]:
s.describe()

count     4
unique    3
top       a
freq      2
dtype: object

In [117]:
# Describing a timestamp Series

In [118]:
s = pd.Series([
  np.datetime64("2000-01-01"),
  np.datetime64("2010-01-01"),
  np.datetime64("2010-01-01")
])

In [119]:
s

0   2000-01-01
1   2010-01-01
2   2010-01-01
dtype: datetime64[ns]

In [120]:
s.describe(datetime_is_numeric=True)

count                      3
mean     2006-09-01 08:00:00
min      2000-01-01 00:00:00
25%      2004-12-31 12:00:00
50%      2010-01-01 00:00:00
75%      2010-01-01 00:00:00
max      2010-01-01 00:00:00
dtype: object

In [121]:
# Describing a DataFrame. By default only numeric fields are returned.
df = pd.DataFrame({'categorical': pd.Categorical(['d','e','f']),
                   'numeric': [1, 2, 3],
                   'object': ['a', 'b', 'c']
                  })

In [122]:
df

  categorical  numeric object
0           d        1      a
1           e        2      b
2           f        3      c

In [123]:
df.describe()#By default only numeric fields are returned.

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [124]:
# Describing all columns of a DataFrame regardless of data type.
df.describe(include='all')

       categorical  numeric object
count            3      3.0      3
unique           3      NaN      3
top              d      NaN      c
freq             1      NaN      1
mean           NaN      2.0    NaN
std            NaN      1.0    NaN
min            NaN      1.0    NaN
25%            NaN      1.5    NaN
50%            NaN      2.0    NaN
75%            NaN      2.5    NaN
max            NaN      3.0    NaN

In [125]:
# Describing a column from a DataFrame by accessing it as an attribute.
df.numeric.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: numeric, dtype: float64

In [126]:
df.describe(include=[np.number]) #Including only numeric columns in a DataFrame description.

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [127]:
# Including only string columns in a DataFrame description.
df.describe(include=[object])

       object
count       3
unique      3
top         c
freq        1

In [128]:
# Including only categorical columns from a DataFrame description.
df.describe(include=['category'])

       categorical
count            3
unique           3
top              d
freq             1

In [129]:
# Excluding numeric columns from a DataFrame description.
df.describe(exclude=['category',np.number])

       object
count       3
unique      3
top         c
freq        1

## Value_counts(); Return a Series containing counts of unique values.

In [130]:
df['object'].value_counts()

c    1
b    1
a    1
Name: object, dtype: int64

In [131]:
df['numeric'].value_counts(normalize=True) #With normalize set to True, returns the relative frequency by dividing all values by the sum of values.

1    0.333333
2    0.333333
3    0.333333
Name: numeric, dtype: float64

In [132]:
'''
    Bins can be useful for going from a continuous variable to a categorical variable; instead of counting unique apparitions of values, divide the index in the specified number of half-open bins.

'''
df['numeric'].value_counts(bins=3)

(0.997, 1.667]    1
(1.667, 2.333]    1
(2.333, 3.0]      1
Name: numeric, dtype: int64

In [133]:
s = pd.Series([3, 1, 2, 3, 4, np.nan])

In [134]:
s.value_counts(dropna=False,ascending=True,sort=True)

2.0    1
NaN    1
4.0    1
1.0    1
3.0    2
dtype: int64

## Idxmax() and idxmin()

In [135]:
ids

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

In [136]:
ids.idxmax()

131

In [137]:
s = pd.Series(data=[1, None, 4, 3, 4],
              index=['A', 'B', 'C', 'D', 'E'])

In [138]:
s.idxmax()

'C'

In [139]:
#If skipna is False and there is an NA value in the data, the function returns nan.
s.idxmax(skipna=False)

nan

In [140]:
ids.max()

7.9

In [141]:
ids.idxmax()

131

In [142]:
#Return indices of the maximum values along the given axis.
ids.argmax()

131

In [143]:
ids[131]

7.9

In [144]:
ids.max()

7.9

In [145]:
#Return the row label of the minimum value.
ids.idxmin()

13

In [146]:
ids[13]

4.3

In [147]:
ids.min()

4.3

In [148]:
#Return indices of the minimum values along the given axis.
ids.argmin()

13

In [149]:
ids[13]

4.3

## Sorting with sorting values()

In [150]:
# Sort by the values
ids.sort_values()

13     4.3
42     4.4
38     4.4
8      4.4
41     4.5
      ...
122    7.7
118    7.7
117    7.7
135    7.7
131    7.9
Name: sepal length (cm), Length: 150, dtype: float64

In [151]:
ids.sort_values(ascending=False)

131    7.9
135    7.7
122    7.7
117    7.7
118    7.7
      ...
41     4.5
42     4.4
38     4.4
8      4.4
13     4.3
Name: sepal length (cm), Length: 150, dtype: float64

In [152]:
# Sort values ascending order (default behaviour)
ids.sort_values(ascending=True,inplace=True)

In [153]:
ids.sort_values(ascending=True,inplace=False)

13     4.3
42     4.4
38     4.4
8      4.4
41     4.5
      ...
117    7.7
135    7.7
122    7.7
118    7.7
131    7.9
Name: sepal length (cm), Length: 150, dtype: float64

In [154]:
# Sort values descending order
ids.sort_values(ascending=False)

131    7.9
135    7.7
117    7.7
118    7.7
122    7.7
      ...
41     4.5
38     4.4
42     4.4
8      4.4
13     4.3
Name: sepal length (cm), Length: 150, dtype: float64

In [155]:
s = pd.Series([np.nan, 1, 3, 10, 5])

In [156]:
s

0     NaN
1     1.0
2     3.0
3    10.0
4     5.0
dtype: float64

In [157]:
# Sort values putting NAs first
s.sort_values(na_position="first")

0     NaN
1     1.0
2     3.0
4     5.0
3    10.0
dtype: float64

In [158]:
# Sort a series of strings
s = pd.Series(['z', 'b', 'd', 'a', 'c'])
s

0    z
1    b
2    d
3    a
4    c
dtype: object

In [159]:
s.sort_values()

3    a
1    b
4    c
2    d
0    z
dtype: object

In [160]:
s = pd.Series(['a', 'B', 'c', 'D', 'e'])
s.sort_values()

1    B
3    D
0    a
2    c
4    e
dtype: object

In [161]:
# Sort using a key function. Your key function will be given the Series of values and should return an array-like.
s.sort_values(key=lambda x:x.str.lower())

0    a
1    B
2    c
3    D
4    e
dtype: object

In [162]:
# we can sort by the sin of the value
s = pd.Series([-4, -2, 0, 2, 4])
s.sort_values(key=np.sin,ascending=True)

1   -2
4    4
2    0
0   -4
3    2
dtype: int64

In [163]:
ids.cumsum()

13       4.3
42       8.7
38      13.1
8       17.5
41      22.0
       ...
122    845.5
118    853.2
117    860.9
135    868.6
131    876.5
Name: sepal length (cm), Length: 150, dtype: float64

In [164]:
# Sort By Index
ids.sort_index()

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

In [165]:
a=ids.sort_index()

In [166]:
a

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

## nlargest and nsmallest()

In [167]:
# Return the largest n elements.
ids.nlargest(n=3,keep="first")

131    7.9
122    7.7
118    7.7
Name: sepal length (cm), dtype: float64

In [168]:
countries_population = {"Italy": 59000000, "France": 65000000,
                        "Malta": 434000, "Maldives": 434000,
                        "Brunei": 434000, "Iceland": 337000,
                        "Nauru": 11300, "Tuvalu": 11300,
                        "Anguilla": 11300, "Montserrat": 5200}
s = pd.Series(countries_population)

In [169]:
s

Italy         59000000
France        65000000
Malta           434000
Maldives        434000
Brunei          434000
Iceland         337000
Nauru            11300
Tuvalu           11300
Anguilla         11300
Montserrat        5200
dtype: int64

In [170]:
# The n largest elements where n=5 by default.
s.nlargest(keep="first")

France      65000000
Italy       59000000
Malta         434000
Maldives      434000
Brunei        434000
dtype: int64

In [171]:
# The n largest elements where n=3. Default keep value is ‘first’ so Malta will be kept.
s.nlargest(n=3,keep="first")

France    65000000
Italy     59000000
Malta       434000
dtype: int64

In [172]:
# The n largest elements where n=3 and keeping the last duplicates. Brunei will be kept since it is the last with value 434000 based on the index order.
s.nlargest(n=3,keep="last")

France    65000000
Italy     59000000
Brunei      434000
dtype: int64

#### nsmallest()--Return the smallest n elements.

In [173]:
# The n smallest elements where n=5 by default.
s.nsmallest()

Montserrat      5200
Nauru          11300
Tuvalu         11300
Anguilla       11300
Iceland       337000
dtype: int64

In [174]:
# The n smallest elements where n=3. Default keep value is ‘first’ so Nauru and Tuvalu will be kept.
s.nsmallest(3)

Montserrat     5200
Nauru         11300
Tuvalu        11300
dtype: int64

In [175]:
# when use keep is last that time return last duplicate value
s.nsmallest(keep="last")

Montserrat      5200
Anguilla       11300
Tuvalu         11300
Nauru          11300
Iceland       337000
dtype: int64

In [176]:
# The n smallest elements where n=3 with all duplicates kept. Note that the returned Series has four elements due to the three duplicates.
s.nsmallest(3, keep='all')

Montserrat     5200
Nauru         11300
Tuvalu        11300
Anguilla      11300
dtype: int64

## Calculating Variance and Standard Deviation

In [177]:
ids.std()

0.8280661279778633

In [178]:
ids.var()

0.685693512304251

## Cumulative Operations

In [203]:
s=pd.Series([1,2,3,4,5,5,0,10,11])
s1=pd.Series([1,2,3,4,5,6])

In [204]:
#  covariance is a measure of the joint variability of two random variables
s1.cov(s)

3.0

In [205]:
s

0     1
1     2
2     3
3     4
4     5
5     5
6     0
7    10
8    11
dtype: int64

In [206]:
# By default, iterates over rows and finds the maximum in each column. This is equivalent to axis=None or axis='index'.
s.cummax()

0     1
1     2
2     3
3     4
4     5
5     5
6     5
7    10
8    11
dtype: int64

In [210]:
# By default, iterates over rows and finds the minimum in each column. This is equivalent to axis=None or axis='index'.
s.cummin()

0    1
1    1
2    1
3    1
4    1
5    1
6    0
7    0
8    0
dtype: int64

In [211]:
s.cumsum()

0     1
1     3
2     6
3    10
4    15
5    20
6    20
7    30
8    41
dtype: int64

In [212]:
s.cumprod()

0      1
1      2
2      6
3     24
4    120
5    600
6      0
7      0
8      0
dtype: int64

## Series Iteration

In [229]:
for index,value in s.items():
    print(f"index:{index} and Value:{value}")

index:0 and Value:1
index:1 and Value:2
index:2 and Value:3
index:3 and Value:4
index:4 and Value:5
index:5 and Value:5
index:6 and Value:0
index:7 and Value:10
index:8 and Value:11

In [230]:
for index,value in s.items():
    print("Index is:{} and Value is:{}".format(index,value))

Index is:0 and Value is:1
Index is:1 and Value is:2
Index is:2 and Value is:3
Index is:3 and Value is:4
Index is:4 and Value is:5
Index is:5 and Value is:5
Index is:6 and Value is:0
Index is:7 and Value is:10
Index is:8 and Value is:11

## Filtering: filter(), where(), And mask()

In [244]:
# select index by regular expression
ids.filter(regex='6$')

6      4.6
106    4.9
26     5.0
46     5.1
16     5.4
36     5.5
66     5.6
96     5.7
126    6.2
146    6.3
56     6.3
136    6.3
116    6.5
86     6.7
76     6.8
Name: sepal length (cm), dtype: float64

In [252]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [253]:
# select columns by name
df.filter(items=['one','two'])

        one  two
mouse     1    2
rabbit    4    5

In [255]:
# select columns by regular expression
df.filter(regex='e$',axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [256]:
# select rows containing 'bbi'
df.filter(like='bbi',axis=0)

        one  two  three
rabbit    4    5      6

### where() and mask()

In [259]:
s=pd.Series(range(10))

In [260]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [264]:
s.where(s>1)
# if s greater than 1, return values and Which is not match, it show NaN

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [266]:
s.where(s>1,10)
# First Cond:if s greater than 1, return values and Second Cond:Which is not match, it show 10

0    10
1    10
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9
dtype: int64

In [271]:
# if s greater than 1, return Nan and Which is not match, it show value
s.mask(s>1)

0    0.0
1    1.0
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [273]:
# First Cond:if s greater than 1, return Nan which replace with 10 and Second Cond:Which is match, it show 10 
s.mask(s>1,10)

0     0
1     1
2    10
3    10
4    10
5    10
6    10
7    10
8    10
9    10
dtype: int64

In [277]:
df =pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])

In [275]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [279]:
m = df % 3 == 0
df.where(m,-df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [293]:
df.mask(~m,-df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [294]:
df.where(m,-df)==df.mask(~m,-df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True